# Structural Connection Handler Type Add Elements To Custom Connection Method

Source: https://www.revitapidocs.com/2026/4ce5c475-c74a-c5aa-0724-8df7c1a0cacb.htm

---

| Structural Connection Handler Type Add Elements To Custom Connection Method |
| --- |

**Note: This API is now obsolete.**

**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Prefer updateCustomConnectionType instead.")]
public static void AddElementsToCustomConnection(
	StructuralConnectionHandler structuralConnectionHandler,
	IList<Reference> references
)
```

```
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Prefer updateCustomConnectionType instead.")>
Public Shared Sub AddElementsToCustomConnection (
	structuralConnectionHandler As StructuralConnectionHandler,
	references As IList(Of Reference)
)
```

```
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Prefer updateCustomConnectionType instead.")]
static void AddElementsToCustomConnection(
	StructuralConnectionHandler^ structuralConnectionHandler,
	IList<Reference^>^ references
)
```

```
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Prefer updateCustomConnectionType instead.")>]
static member AddElementsToCustomConnection :
        structuralConnectionHandler : StructuralConnectionHandler *
        references : IList<Reference> -> unit
```

#### Parameters

structuralConnectionHandler StructuralConnectionHandler
references IList Reference

See Also

#### Reference

StructuralConnectionHandlerType Class Autodesk.Revit.DB.Structure Namespace